CSI API ETABS v1

# cLoadCasesDirHistLinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseDirectHistoryLinear DirHistLinear { get; }

    ReadOnly Property DirHistLinear As cCaseDirectHistoryLinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseDirectHistoryLinear

    value = instance.DirHistLinear

    property cCaseDirectHistoryLinear^ DirHistLinear {
    	cCaseDirectHistoryLinear^ get ();
    }

    abstract DirHistLinear : cCaseDirectHistoryLinear with get

#### Property Value

Type: cCaseDirectHistoryLinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com